Revit 2024 API
LineLoad.IsUniform Property
 Indicates if the load is uniform.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsUniform { get; }
Visual Basic
Public ReadOnly Property IsUniform As Boolean
	Get
Visual C++
public:
property bool IsUniform {
	bool get ();
}
Remarks
 Returns true if the line load is uniform, false otherwise. Load is uniform when force and moment vectors assigned to the start and the end point of load are equal.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace